package lqh.wanandroid.config

/**
 * 功能：APP 配置文件
 * -------------------------------------------------------------------------------------------------
 * 创建者：@author lqh
 * -------------------------------------------------------------------------------------------------
 * 创建日期：2019/8/3
 * -------------------------------------------------------------------------------------------------
 * 更新历史
 * 编号|更新日期|更新人|更新内容
 */
object AppConfig {
    /**
     * 请求域名
     */
    const val HOST = "https://www.wanandroid.com"

    /**
     * 请求超时的时间，单位：秒
     */
    const val REQUEST_TIME_OUT = 30L

    /**
     * 是否正式环境
     */
    const val IS_PRO = true
}